app/views/users/_user.html.erb

<td>
  <% user.addresses.each do |address| %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 1]]