app/views/users/edit.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 3]]
---
    <div class="col-md-6 col-md-offset-3">
      <% @user.addresses.each do |address| %>