app/views/addresses/_form.html.erb

      <div class="form-group">
        <% @user = User.find(session[:user_id])%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]