app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("province", "city", "street", "other", "reference", "number", "created_at", "updated_at", "user_id", "cep", "title") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @address.update(address_params)
---
UPDATE "addresses" SET "cep" = ?, "title" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["cep", "99010-120"], ["title", "Endereço PF"], ["updated_at", 2017-04-15 19:29:03 UTC], ["id", 2]]