app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_or_create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-04-09 17:29:22 UTC], ["updated_at", 2017-04-09 17:29:22 UTC]]