app/controllers/users_controller.rb

UPDATE "users" SET "birthday_date" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["birthday_date", Thu, 20 Apr 2017], ["updated_at", 2017-04-09 18:33:38 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)