app/views/layouts/_nav_links_for_auth.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
<% if user_signed_in? %>
    <% @user = User.find(session[:user_id])%>